test/data/tr_GetParameterNames.xml

<soap-env:Envelope xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" 
                   xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" 
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
                   xmlns:cwmp="urn:dslforum-org:cwmp-1-0"> 
  <soap-env:Header> 
    <cwmp:ID soap-env:mustUnderstand="1">0</cwmp:ID> 
  </soap-env:Header>
  <soap-env:Body> 
    <cwmp:GetParameterNames> 
      <ParameterPath>Object.</ParameterPath> 
      <NextLevel>0</NextLevel> 
    </cwmp:GetParameterNames> 
  </soap-env:Body> 
</soap-env:Envelope> 